Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: ལྟ་བ་གང་གིས་ལོག་པར་ལྟ་བ་ལ་གནས་པར་བྱེད་པའི་ལྟ་བ་དེ་ལ་ཡོངས་སུ་མི་འཛིན་ཅིང་མི་ལེན་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Not grasping or appropriating any views that cause one to persist in mistaken views is to uphold the sublime Dharma.

source: མི་ཤེས་པ་གཏི་མུག་གི་ལིང་ཏོག་གང་གིས་སེམས་ཡོངས་སུ་དཀར་བར་མི་འགྱུར་བའི་མི་ཤེས་པའི་གཏི་མུག་གི་ལིང་ཏོག་དེ་ལ་གང་ཡོངས་སུ་མི་འཛིན་ཅིང་མི་ལེན་པ་འདི་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱའོ། །
en: Not grasping at or appropriating the veils of unknowing or stupidity that stain the mind is upholding the sublime Dharma.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་གང་བསྒྲུབས་ནས་སྤང་བར་བྱ་བ་དེ་ནི་ཆོས་མ་ཡིན་འདུལ་བ་མ་ཡིན་ནོ། །
en: “ ‘Moreover, noble son, needing to establish or abandon something is not the Dharma or the Vinaya.

source: གང་བསྒྲུབ་པར་ཡང་མི་བྱ་སྤང་བར་ཡང་མི་བྱ་བ་འདི་ནི་ཆོས་སོ། །
en: Not establishing or abandoning anything is the Dharma and the Vinaya.

source: དེ་ནི་འདུལ་བའོ་བསྒྲུབས་ནས་སྤང་བར་བྱ་བའི་ཆོས་གང་ཞེ་ན་འདུས་བྱས་ཀྱི་ལམ་སྟེ། བསྒྲུབས་ནས་སྤང་བར་བྱ་བ་དེ་ནི་ཆོས་མ་ཡིན་འདུལ་བ་མ་ཡིན་ནོ། །
en: Any Dharma that involves establishing or abandoning something is the conditioned path, and accomplishing and abandoning are not the Dharma or the Vinaya.

source: བསྒྲུབ་པར་བྱ་བ་ཡང་མ་ཡིན་སྤང་བར་བྱ་བ་ཡང་མ་ཡིན་པ་གང་ཞེ་ན།
en: “ ‘What is it that neither needs to be established nor abandoned?

source: གང་བརྗོད་དུ་མེད་པ་དང་སྐྱེ་བ་མེད་པ་དང་འབྱུང་བ་མེད་པ་སྟེ། དེ་ནི་བསྒྲུབ་པར་བྱ་བ་ཡང་མ་ཡིན་སྤང་བར་བྱ་བ་ཡང་མ་ཡིན་པའོ། །
en: It is that which is indescribable, unborn, and non-arising— that neither needs to be established nor abandoned.

source: གང་བསྒྲུབ་པར་བྱ་བ་ཡང་མ་ཡིན་སྤང་བར་བྱ་བ་ཡང་མ་ཡིན་པ་དེ་ཆོས་སོ། །
en: What does not need to be established or abandoned is the Dharma and the Vinaya.

source: དེ་འདུལ་བའོ་ཅིའི་ཕྱིར་དེ་ཆོས་ཡིན་དེ་འདུལ་བ་ཡིན་ཞེ་ན།
en: “ ‘Why is this the Dharma? Why is this the Vinaya?

source: རང་བཞིན་གྱིས་མ་སྐྱེས་པའི་ཉོན་མོངས་པ་རྣམས་སྐྱེ་བར་མི་བྱེད་པས་དེའི་ཕྱིར་དེ་ཆོས་ཡིན། དེ་འདུལ་བ་ཡིན་ཞེས་བྱའོ། །
en: It is the Dharma and the Vinaya because it prevents afflictions that are naturally unborn from arising.

source: ཆོས་དང་འདུལ་བ་གང་ཡིན་པ་དེ་ནི་སྐྱེ་བ་མེད་པ་འགག་པ་མེད་པའོ། །
en: The Dharma and the Vinaya are unborn and unceasing. What is unborn and unceasing is inexhaustible.

source: གང་སྐྱེ་བ་མེད་འགག་པ་མེད་པ་དེ་ནི་ཟད་པར་མི་འགྱུར་རོ་དེ་ལྟར་ཟད་པ་མེད་པ་དང་། སྐྱེ་བ་མེད་པའི་ཆོས་དང་འདུལ་བ་དེ་ནི་ཇི་ལྟར་འབྱུང་བ་མེད་པ་དེ་ལྟར་ཡོངས་སུ་གཟུང་བ་མེད་དོ། །
en: Likewise the inexhaustible and unborn Dharma and Vinaya are ungraspable insofar as they are non-arising.

source: གང་ཡོངས་སུ་གཟུང་བ་མེད་པ་དེ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །
en: Not grasping is upholding the sublime Dharma.’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བཅོམ་ལྡན་འདས་ཡེ་ཤེས་ཆེན་པོའི་སྟོབས་བསྒྲགས་པའི་དེ་བཞིན་གཤེགས་པ་དེས་བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སུམ་ཁྲི་ཉིས་སྟོང་གིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་སྐྱེས་སོ། །
en: “Noble son, once the blessed thus-gone Teacher of the Power of Great Wisdom had given this teaching, thirty-two thousand bodhisattva great beings attained the acceptance that phenomena are unborn.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སྨྲ་བས་བཅོམ་ལྡན་འདས་དེ་ལས་བསྟན་པ་འདི་ཐོས་ནས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ་
en: When the bodhisattva Dharma Teacher heard this teaching, it left him satisfied, happy, delighted, and joyful.

source: དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས། བཅོམ་ལྡན་འདས་དེ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “In such a happy and joyful state of mind he said,

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་འདི་ལེགས་པར་གསུངས་པ་ནི་ངོ་མཚར་ཏོ། །
en: ‘Blessed One, what the Thus-Gone One has said about the way in which bodhisattvas uphold the sublime Dharma is amazing.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན་བདག་འདི་སྙམ་བགྱིད་དེ།
en: Yet, if I were to offer my understanding of what was expressed by the Blessed One, then I think that phenomena are not the Dharma.

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་ཆོས་མ་ལགས་སོ། །གང་ཆོས་མ་ལགས་པ་དེ་ནི་ཆོས་སོ། །
en: Dharma is whatever is beyond phenomena.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is this?

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་མངོན་པར་ཞེན་པས་ཆོས་མ་ལགས་སོ། །
en: Blessed One, when there is clinging to any phenomenon, that is not the Dharma.

source: གང་མངོན་པར་ཞེན་པ་མ་མཆིས་པ་དེ་ནི་ཆོས་སོ། །
en: When there is no clinging, that is the Dharma.

source: བཅོམ་ལྡན་འདས་ཆོས་དང་ཆོས་མ་ལགས་པ་གཉིས་ཀྱི་འདུ་ཤེས་དང་ལྡན་པའི་ཆོས་ཐམས་ཅད་ནི་ཆོས་མ་ལགས་པའོ། །
en: “ ‘Blessed One, anything that involves a dualistic perception of Dharma and non-Dharma is not the Dharma.

source: བཅོམ་ལྡན་འདས་འདུ་ཤེས་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པའི་ཆོས་ཐམས་ཅད་ནི་ཆོས་སོ། །
en: Blessed One, anything that involves knowledge of perceptions is the Dharma.

source: བཅོམ་ལྡན་འདས་དོན་དམ་པར་བསྟན་ན་ཆོས་དང་ཆོས་མ་ལགས་པ་མི་དམིགས་སོ། །
en: When described ultimately, Dharma and non-Dharma cannot be observed.

source: གང་ལ་ཆོས་ཀྱི་འདུ་ཤེས་ཀྱང་མ་མཆིས། ཆོས་མ་ལགས་པའི་འདུ་ཤེས་ཀྱང་མ་མཆིས་པ་དེ་ལ་ཆོས་སུ་བགྲང་བ་གང་ཡང་མ་མཆིས་སོ། །
en: Where there is no perception of Dharma or non-Dharma, nothing can be counted as Dharma.

source: གང་ལ་ཆོས་སུ་བགྲང་བ་གང་ཡང་མ་མཆིས་པ་དེ་མཐའ་མ་ལགས་པའོ། །
en: Where there is nothing that can be counted as Dharma, there are no limits.

source: གང་མཐའ་མ་ལགས་པ་དེ་ཡང་དག་པའི་མཐའོ། །
en: Where there are no limits, that is the limit of reality.

source: ནམ་མཁའི་མཐའ་ནི་ཡང་དག་པའི་མཐའ་སྟེ།
en: ‘The limit of space is the limit of reality.

source: ནམ་མཁའ་ལ་ནི་ཚར་གཅད་པའི་མཐའ་གང་ཡང་མ་མཆིས་སོ། །
en: For space, there is no limit of destruction.

source: ཇི་ལྟར་ནམ་མཁའ་ལ་ཚར་གཅད་པའི་མཐའ་གང་ཡང་མ་མཆིས་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ལ་ཡང་ཚར་གཅད་པའི་མཐའ་གང་ཡང་མ་མཆིས་ཏེ།
en: As there is no limit of destruction for space, there is likewise no limit of destruction for any phenomenon.

source: དེའི་སླད་དུ་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའི་མཐའ་ཞེས་བགྱིའོ། །
en: For this reason, all phenomena can be called the limit of space .

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གིས་ཡང་དག་པའི་མཐའ་བསྟན་པ་འདི་ཐོས་ནས་དེ་བཞིན་དུ་ཡང་དག་པ་ཉིད་དུ་ཁས་ལེན་པ་དེ་དག་ནི་ཆོས་གང་ལ་ཡང་གཉིས་སུ་དབྱེ་བར་ཁས་ལེན་པ་མ་ལགས་སོ། །
en: Blessed One, any bodhisattva who hears this teaching on the limit of reality and claims it to be true will not take the position that phenomena are divisible.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ནི་ཆོས་གང་ཡོངས་སུ་བཟུང་བས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་བསྟན་པའི་ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་། །
en: Blessed One, I do not see any perceived phenomenon that can be said to be upholding the sublime Dharma.

source: བཅོམ་ལྡན་འདས་བདག་གིས་དེ་ལྟར་བསྟན་ན་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་སྨྲ་བ་དང་། ཆོས་སྨྲ་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་སུ་ལུང་སྟོན་པ་ལྟ་ལགས་སམ།
en: However, Blessed One, when I say this, am I in accord with the teachings of the Thus-Gone One, and those who teach the Dharma, and the Dharma itself?

source: ཡང་དག་པའི་ལུང་བསྟན་པས་ལུང་སྟོན་པ་ལྟ་ལགས་སམ།
en: Is my explanation a true teaching?’

source: བཅོམ་ལྡན་འདས་དེས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཡང་དག་པ་སྟེ།
en: “ ‘Noble son,’ answered the Blessed One, ‘it is true.

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པ་སྨྲ་བ་དང་། ཆོས་སྨྲ་བ་དང་། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་སུ་ལུང་སྟོན་པ་ཡིན་ནོ། །
en: That is an explanation that accords with the teachings of the Thus-Gone One, and those who teach the Dharma, and the Dharma itself.

source: ཡང་དག་པའི་ལུང་བསྟན་པས་ལུང་སྟོན་པ་ཡིན་ནོ། །
en: What you have taught is a true teaching.’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སྨྲ་བས་ལུང་བསྟན་པ་འདི་བཤད་པ་ན་ལྷའི་འཁོར་དེ་ལས་ལྷའི་བུ་ཁྲིས་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: “Noble son, when the bodhisattva Dharma Teacher gave this teaching, ten thousand gods from the divine assembly gained acceptance of phenomena concurring with reality.

source: ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྣང་བ་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་སྨྲ་བར་གྱུར་པ་ཞེས་བྱ་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཚོམ་ཟའམ། ཡིད་གཉིས་སུ་གྱུར་ན་དེ་དེ་ལྟར་མི་བལྟའོ། །
en: Light King of Qualities, if you are wondering, doubting, or of two minds about whether he who at that time was the bodhisattva Dharma Teacher is somebody unknown to you, do not think any further.

source: ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྣང་བ་ཁྱོད་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་ཆོས་སྨྲ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: Because, Light King of Qualities, you were at that time the bodhisattva Dharma Teacher !

source: དེའི་ཕྱིར་ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྣང་བ་ངས་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བར་བསྒྲུབས་པ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཁྱོད་ལ་གཏད་དོ། །
en: Therefore, Light King of Qualities, I entrust my unsurpassed and perfect awakening accomplished through countless billions of eons to you.

source: གཟུང་བ་དང་། བཅང་བ་དང་། ཀུན་ཆུབ་པར་བྱ་བ་དང་། གཞན་དག་ལའང་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པར་བྱ་བའི་ཕྱིར་འཁོར་འདིའི་མདུན་དུ་ངས་ཁྱོད་ལ་བཅོལ་ཏོ། །
en: I entrust it to you before this assembly so that you may uphold it, keep it, realize it, and teach it widely to others.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུང་འདི་གསུངས་མ་ཐག་ཏུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་སྟན་ལས་ལངས་ཏེ་
en: As soon as the Blessed One made this announcement, six hundred million bodhisattvas rose from their seats and proclaimed with one voice,

source: མགྲིན་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་འདི་གཟུང་བར་བགྱིའོ་ཞེས་སྨྲས་སོ། །
en: “We will also uphold the Thus-Gone One’s awakening!”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་རྣམས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then asked of all of them,

source: རིགས་ཀྱི་བུ་དག་ཁྱེད་ཀྱིས་ཆོས་ཇི་ལྟ་བུ་ཞིག་ལ་གནས་ཏེ་ངས་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བར་བསྒྲུབས་པའི་བྱང་ཆུབ་འདི་འཛིན་པར་བྱེད།
en: “Noble children, what Dharma will you live by, such that you will uphold this awakening that I have gained through countless billions of eons of practice?”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རི་དབང་གི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེར་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, a bodhisattva present in the assembly named Lord of Mountains promised the Blessed One,

source: བཅོམ་ལྡན་འདས་ལུས་དང་སྲོག་ལ་ལྟ་བས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma while being concerned with their body or life,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བགྱིས་ལ་བཅོམ་ལྡན་འདས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: I will uphold the Blessed One’s sublime Dharma while ignoring my body and life.”

source: བྱང་ཆུབ་སེམས་དཔའ་དཔལ་བརྩེགས་རྒྱལ་པོ་ཞེས་བྱ་བ་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: The bodhisattva King of Splendors promised,

source: བཅོམ་ལྡན་འདས་རྙེད་པ་དང་བཀུར་སྟི་དང་ཚིགས་སུ་བཅད་པ་ལ་རེ་བས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma while hoping for gain, praise, or accolades,

source: བཅོམ་ལྡན་འདས་བདག་གིས་རྙེད་པ་དང་བཀུར་སྟི་དང་ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་བོར་ལ་འཕགས་པ་མ་ལགས་པ་དང་བསྟེན་པ་ཐམས་ཅད་ཡོངས་སུ་སྤངས་ཏེ་དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: I will uphold the Thus-Gone One’s sublime Dharma while casting aside gain, praise, and accolades, and avoiding relying on those who are not noble ones.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཏོག་ཆེན་པོས་གསོལ་པ།
en: The bodhisattva Great Crest promised,

source: བཅོམ་ལྡན་འདས་ཆོས་དང་ཆོས་མ་ལགས་པ་གཉིས་ཀྱི་འདུ་ཤེས་དང་ལྡན་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ། བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཐམས་ཅད་གཉིས་དང་བྲལ་བ་མཉམ་པ་ཉིད་ཐོབ་པར་བགྱིས་ཏེ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: “Blessed One, given that no one could uphold the sublime Dharma while holding the notion of Dharma and non-Dharma, Blessed One, I will uphold the sublime Dharma while mastering the nondual sameness of all phenomena.”

source: བྱང་ཆུབ་སེམས་དཔའ་དཔལ་སྦས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Śrīgupta promised,

source: བཅོམ་ལྡན་འདས་ཉོན་མོངས་པ་རྣམས་ཀྱིས་ཟིལ་གྱིས་ནོན་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma if they were outdone by the afflictions,

source: བཅོམ་ལྡན་འདས་བདག་གིས་འཕགས་པའི་ཤེས་རབ་དང་ཡེ་ཤེས་ཀྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་ཟིལ་གྱིས་མནན་ཏེ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma by outdoing the afflictions with the insight and wisdom of the noble ones.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྒྲོན་མ་འཛིན་གྱིས་གསོལ་པ།
en: The bodhisattva Lamp Holder promised,

source: བཅོམ་ལྡན་འདས་གཏི་མུག་གི་མུན་པའི་སྤྱོད་ཡུལ་གྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma while enmeshed in the darkness of stupidity,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཆགས་པ་མ་མཆིས་པའི་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཐོབ་པར་བགྱིས་ལ་ཆོས་ཐམས་ཅད་ལ་གཏི་མུག་གི་མུན་པ་དང་བྲལ་བར་བགྱིས་ཏེ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma while attaining the light of the wisdom of nonattachment, and escape the darkness of stupidity with regard to all phenomena.”

source: བྱང་ཆུབ་སེམས་དཔའ་གློག་ལྟས་གསོལ་པ།
en: The bodhisattva Lightning Gaze promised,

source: བཅོམ་ལྡན་འདས་གཞན་ལ་རག་ལས་པའི་ཡེ་ཤེས་ཀྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma with wisdom that relies on others,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པར་མངོན་སུམ་གྱི་ཡེ་ཤེས་ཐོབ་པར་བགྱིས་ཏེ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma by mastering the wisdom that directly perceives all phenomena, without relying on anything else.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་སྦས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Hidden promised,

source: བཅོམ་ལྡན་འདས་དབང་པོ་ཕལ་པ་དང་འཁྲུལ་པའི་སེམས་ཀྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma with ordinary faculties and a confused mind,

source: བཅོམ་ལྡན་འདས་བདག་གིས་དབང་པོ་ཐམས་ཅད་དུ་དང་སྒོ་དང་སྐྱེ་མཆེད་ཐམས་ཅད་ཤིན་ཏུ་སྦས་ཤིང་ཤིན་ཏུ་བཏུལ་ལ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma while hiding and taming all faculties, sense doors, and sense sources.”

source: བྱང་ཆུབ་སེམས་དཔའ་འོད་དྲི་མ་མེད་པས་གསོལ་པ།
en: The bodhisattva Vimalaprabhā promised,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་དང་ཆོས་ཐ་དད་པའི་འདུ་ཤེས་དང་ལྡན་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma with a notion of discrete beings and phenomena,

source: བཅོམ་ལྡན་འདས་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་སེམས་སྙོམས་པ་དང་། ཆོས་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཐོབ་པར་བགྱིས་ཏེ། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma while mastering an unbiased attitude toward all beings and the sameness of all phenomena.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྱད་པར་དུ་འགྲོ་བས་གསོལ་པ།
en: The bodhisattva Viśeṣagāmin promised,

source: བཅོམ་ལྡན་འདས་མཉམ་པར་མ་བཞག་ཅིང་གཡེང་བའི་སེམས་ཀྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma with a mind that is distracted and not settled in equipoise,

source: བཅོམ་ལྡན་འདས་བདག་གིས་མཉམ་པར་བཞག་ལ་མི་གཡེང་བའི་སེམས་ཀྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma with a mind that is undistracted from equipoise.”

source: བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་གྱིས་གསོལ་པ།
en: The bodhisattva Sārthavāha promised,

source: བཅོམ་ལྡན་འདས་ལམ་ཤེས་པའི་ཆོ་ག་མ་འཚལ་ཅིང་ལམ་ངན་པར་ཞུགས་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma while following wrong paths and without understanding the rites that bring proper knowledge of the path,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ལམ་ཤེས་པའི་ཆོ་ག་འཚལ་བར་བགྱིས་ལ་སེམས་ཅན་རྣམས་ལམ་ངན་པ་ལས་ཡང་དག་པའི་ལམ་ལ་རབ་ཏུ་དགོད་ཅིང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma with understanding of the rites that bring proper knowledge of the path and while delivering beings from wrong paths onto the true path.”

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་ལེགས་པས་གསོལ་པ།
en: The bodhisattva Excellent Intelligence promised,

source: བཅོམ་ལྡན་འདས་དོགས་པའི་སེམས་ཐེ་ཚོམ་དུ་གྱུར་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma while lost in the anxious mind of doubt,

source: བཅོམ་ལྡན་འདས་བདག་གིས་དོགས་པ་དང་བྲལ་ཞིང་ཐེ་ཚོམ་ཐམས་ཅད་སྤངས་ལ་དོགས་པའི་ཟུག་རྔུ་ཐམས་ཅད་བསལ་བ་ཐོབ་པར་བགྱིས་ཏེ། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma by eliminating all anxiety, abandoning all doubt, and scattering the pain of fear.”

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བྱེད་ཀྱིས་གསོལ་པ།
en: The bodhisattva Vairocana promised,

source: བཅོམ་ལྡན་འདས་ཆོས་ལ་མི་གནས་ཤིང་སྒྲུབ་པ་ཉམས་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma if they did not live by the Dharma and if they let their practice decline,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ལ་གནས་ཤིང་སྒྲུབ་པ་སྙིང་པོར་བགྱིས་ཏེ་སེམས་ཅན་རྣམས་ཡང་དག་པའི་ནན་ཏན་ལ་རབ་ཏུ་དགོད་ཅིང་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma while living by the Dharma, making my practice meaningful, and establishing all beings in right endeavor.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྣང་བ་མཐོང་བས་གསོལ་པ།
en: The bodhisattva Seer of Light promised,

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་འཆལ་པ་ཆོས་ཀྱི་སྣང་བ་དང་བྲལ་བས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, given that no one could uphold the sublime Dharma with misguided insight and without the light of Dharma,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཤེས་རབ་ཀྱིས་རྣམ་པར་ངེས་པའི་ཡེ་ཤེས་ལ་མཁས་ཤིང་ཆོས་ཀྱི་སྣང་བ་དང་ལྡན་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma with the light of Dharma and with skill in definitive wisdom gained through insight.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཞེ་འགྲས་པ་མེད་པའི་བློ་གྲོས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Non-aggressive Intellect promised,

source: བཅོམ་ལྡན་འདས་ཞེ་འགྲས་པའི་སེམས་དང་སེམས་ཅན་རྗེས་སུ་མི་སྲུང་བའི་བློས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ
en: “Blessed One, given that no one could uphold the sublime Dharma with an aggressive mind and without the intention to protect beings,

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཞེ་འགྲས་པ་མ་མཆིས་པའི་སེམས་དང་སེམས་ཅན་རྗེས་སུ་སྲུང་བ་ལ་གནས་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma with a mind that has no aggression and consistently protects beings.”

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྱོད་པ་རྣམ་དག་བློ་གྲོས་ཀྱིས་གསོལ་པ།
en: The bodhisattva Intellect of Pure Conduct promised,

source: བཅོམ་ལྡན་འདས་སེམས་ཅན་གྱི་དབང་པོ་ལ་མི་མཁས་ཤིང་སེམས་ཅན་གྱི་སྤྱོད་པའི་ཆོ་ག་མ་འཚལ་བས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ
en: “Blessed One, given that no one could uphold the sublime Dharma without becoming skilled in the faculties of beings and understanding the types of beings’ conduct,

source: བཅོམ་ལྡན་འདས་བདག་གིས་སེམས་ཅན་གྱི་དབང་པོ་དང་སྤྱོད་པ་ཤེས་པ་ལ་ཞུགས་ལ་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the sublime Dharma by seeking knowledge of the faculties and conduct of beings.”

source: བྱང་ཆུབ་སེམས་དཔའ་བཀོད་པའི་རྒྱལ་པོས་གསོལ་པ།
en: The bodhisattva Vyūharāja promised,

source: བཅོམ་ལྡན་འདས་ཆོས་ལ་ཡོངས་སུ་རྟོག་པའི་འདུ་ཤེས་དང་ལྡན་པས་བདག་དང་སེམས་ཅན་དང་ཆོས་ལ་གནས་པས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ
en: “Blessed One, given that no one could uphold the sublime Dharma while entertaining notions of a self, or beings, or phenomena, due to having conceptual notions about phenomena,

source: བཅོམ་ལྡན་འདས་བདག་གིས་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་ཡོངས་སུ་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་ཞིང་འཁོར་གསུམ་ཡོངས་སུ་དག་ལ་བདག་དང་སེམས་ཅན་དང་ཆོས་ལ་མི་གནས་པར་བགྱིད་ཅིང་བཅོམ་ལྡན་འདས་ཀྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, I will uphold the Thus-Gone One’s sublime Dharma by eliminating all thought, concept, and conceptuality; purifying the three spheres; and not entertaining notions of a self, or beings, or phenomena.”

source: བྱང་ཆུབ་སེམས་དཔའ་སེང་གེའི་ཏོག་གིས་གསོལ་པ།
en: The bodhisattva Siṃhaketu promised,

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་འདི་ནི་འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་མ་བྱུང་བ་ལ་སྐྲག་པའོ། །
en: “Blessed One, the world is terrified of the thought that all phenomena are unborn and non-arising.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ནི་ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་མ་བྱུང་བར་འཚལ་ནས་སྐྲག་པ་མ་མཆིས་ཀུན་ཏུ་སྐྲག་པ་མ་མཆིས་ཤིང་ཆོས་གང་ལ་ཡང་ཉེ་བའམ་རིང་བར་མི་གནས་པར་བཅོམ་ལྡན་འདས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Blessed One, as I understand that all phenomena are unborn and non-arising, I will uphold the Blessed One’s sublime Dharma while being free from fear or anxiety and without entertaining any notions of ‘near’ or ‘far’ about any phenomenon.”

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་གསོལ་པ།
en: The bodhisattva Maitreya promised,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ལ་རིང་བའི་འདུ་ཤེས་ཅན་གྱིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ།
en: “Blessed One, those who perceive awakening to be something far off cannot uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་སྙམ་དུ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་ནས་བྱང་ཆུབ་ལུས་དང་སེམས་དང་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་པར་མཐོང་ངོ་སྙམ་པ་དེས་དེ་བཞིན་གཤེགས་པའི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་ནུས་སོ། །
en: Blessed One, bodhisattvas who intend to attain unsurpassed and perfect awakening and then see that awakening is neither devoid of, nor involved in, body and mind, will be able to uphold the Thus-Gone One’s sublime Dharma.”

source: བྱང་ཆུབ་སེམས་དཔའ་ཡོན་ཏན་གྱི་རྒྱལ་པོ་སྣང་བས་གསོལ་པ།
en: The bodhisattva Guṇa­rāja­prabhāsa promised,

source: བཅོམ་ལྡན་འདས་ཡོན་ཏན་ལ་མི་གནས་ཤིང་ཡོན་ཏན་དང་བྲལ་ལ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་དོན་དུ་མི་གཉེར་བས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་མི་ནུས་ཏེ
en: “Blessed One, one cannot uphold the sublime Dharma while not maintaining qualities, or while lacking qualities, or while lacking passion for the qualities of the Thus-Gone One.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཡོན་ཏན་ཐམས་ཅད་དང་མ་བྲལ་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡང་དག་པ་ལ་གནས་ཏེ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཡོངས་སུ་བཙལ་བ་ལ་མངོན་པར་བརྩོན་པས་བཅོམ་ལྡན་འདས་ཀྱི་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བར་བགྱིའོ། །
en: Thus, Blessed One, I will uphold the sublime Dharma by never lacking qualities, and by maintaining authentic bodhisattva qualities, and seeking out the qualities of the Thus-Gone One.”

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གསོལ་པ།
en: The bodhisattva Youthful Mañjuśrī promised,

source: བཅོམ་ལྡན་འདས་གང་འདི་སྐད་དུ་བདག་གིས་དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་ངོ་ཞེས་དེ་སྐད་མཆི་བའི་འཇིག་རྟེན་དེ་ནི་རྣམ་པར་སྨྲ་བ་ལེགས་སོ། །
en: “Blessed One, whenever a worldly person says, ‘I will uphold the sublime Dharma,’ that is wonderful.

source: བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is this, Blessed One?

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཞུགས་ནས་ཆོས་གང་མ་བརྙེས་ཤིང་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པ་དེ་ལ་ཡོངས་སུ་གཟུང་བ་གང་ཡང་མ་མཆིས་སོ། །
en: When the Blessed One sat at the seat of awakening, he neither attained nor realized any Dharma. So in this regard there is nothing to uphold.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་མི་གཟུང་བ་དང་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ་འདོར་དུ་སྩལ་བའི་སླད་དུ་སྙིང་རྗེ་ཆེན་པོའི་ཆོས་ཉིད་འདི་གཟུང་བར་བགྱི།
en: Blessed One, I will uphold the nature of compassion so that I may abandon apprehending any beings and avoid grasping at any phenomena.

source: ཆོས་གང་ཡང་འཕྲོས་པར་མི་བགྱི། འཕྲོས་པ་དང་བྲལ་བར་ཡང་མི་བགྱིའོ། །
en: I do not conceptualize any phenomena and I do not avoid conceptualizing any phenomena.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Blessed One then expressed his approval of Youthful Mañjuśrī, saying,

source: འཇམ་དཔལ་ལེགས་སོ་ལེགས་སོ། །དེ་དེ་བཞིན་ནོ། །
en: “Excellent, Mañjuśrī, excellent. That is correct.

source: ཇི་སྐད་སྨྲས་པ་བཞིན་ཏེ།
en: It is exactly as you have described it.

source: ངས་ཆོས་གང་ཡང་མ་ཐོབ་པར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་གོ། །
en: I did not attain anything when I sat at the seat of awakening.

source: མ་ཐོབ་བཞིན་དུ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལས་ལངས་སོ། །
en: I arose from the seat of awakening without having attained anything.”

source: འཇམ་དཔལ་གྱིས་གསོལ་པ།
en: Mañjuśrī then said,
